<template>
    <div class="dataStr-content">
       
        <h1>자료구조(data structure)란?</h1>
        <br>
        <h2>
        정의</h2>
        <li>프로그래밍에서 데이터를 구조적으로 표현하는 방식과 이를 구현하는 데 필요한 알고리즘 에 대해 논하는 기초이론</li>
            <li>
즉, 알고리즘의 개념을 알아야만 자료구조에 대해 논할 수 있다. 그렇다면 알고리즘은 무엇일까?</li><br>
        <br>
        <h1>알고리즘</h1>
        <br>
        
        <li>어떤 값을 입력으로 받아 원하는 값으로 출력하는 잘 정의된 계산 절차</li>
            <br>
        <br>
      
        <br>
        <h2>
         
자료구조와 알고리즘의 관계</h2>
        <li>자료구조가 먼저 결정되어야 그에 따른 효율적인 알고리즘을 선택할 수 있다. 따라서, 자료구조에 따라 알고리즘은 달라질 수 있고 알고리즘은 자료구조에 의존적이라 할 수 있다.
</li>
            <br>
        <br>
        <h1>자료구조의 종류</h1>
        <br>
        <h2>
        자료구조는 선형구조와 비선형구조로 구분</h2>
        <li></li>
            <br>
        <br>
        <h1>공간적 효율성과 시간적 효율성</h1>
        <br>
        <h2>
        정의</h2>
        <li>공간적 효율성 : 얼마나 적은 용량으로 필요한 가를 의미</li>
        <li>시간적 효율성 : 얼마나 적은 시간을 필요한 가를 의미</li>
        <br>
        <h1>빅오 표기법</h1>
        <br>
    <h2>함수의 복잡도를 정의하는데 사용하는 표기법</h2>
        <li>실행 시간 n을 O(n)으로 표기한다. 일반적으로 양의 두 함수 f와 g에 대한 f(n) = O(g(n))은 함수 f(n)의 시간 복잡도가 O(n)이라는 뜻이다.</li>
        <li>O(1) < O(log n) < O(n) < O( n* log n ) < O(n²) </li>
        <br>
        <h1>
        배열(array)</h1><br>
        <li>같은 타입의 변수들로 이루어진 유한 집합</li>
        <li>배열을 구성하는 각각의 값을 배열 요소(element)라고 하며, 배열에서의 위치를 가리키는 숫자는 인덱스(index)라고 한다.</li>
        <li>인덱스를 통해 배열요소에 직접접근이 가능하지만
미리 선언되어있는 데이터의 고정된 크기만을 갖게된다는 단점이 있다.</li>
<br>
<h1>연결리스트(linked list)</h1>
<br>
        <h2>단일 연결 리스트</h2>
        <br>
        <li>각 노드에 자료 공간(head)과 한 개의 포인터 공간(tail)이 있고, 각 노드의 포인터는 다음 노드를 가리킨다</li>
        <li>선형적 순서 형태를 지니고 있다.</li>
        <li>배열과는 달리 가변적인 크기를 갖는다는 장점이 있다.
하지만 배열보다 더 많은 공간을 필요로 할 수 있고, 구현이 어렵다.</li>
<br>
        <h2>이중 연결 리스트</h2><br>
        <li>단일 연결 리스트와 비슷하지만, 포인터 공간이 두 개가 있고 각각의 포인터는 앞의 노드와 뒤의 노드를 가리킨다.</li>
        <li>이중 연결리스트의 장점은 양방향으로 연결되어 있기 때문에 노드를 탐색하는 방향이 양쪽으로 가능하다는 것이다. </li>
        <li>단점으로는 이전 노드를 지정하기 위한 변수를 하나 더 사용해야 하기 때문에  메모리를 더 많이 사용한다는 점이 있다. 또한 구현이 조금 더 복잡하다는 점도 있다.</li>
        <li> 하지만 노드를 양쪽으로 탐색한다는 장점이 크기 때문에 대부분 이중 연결 리스트를 사용한다.</li>
        <br>
        <h2>순환 연결 리스트</h2><br>
        <li>일반적인 연결 리스트에 마지막 노드와 처음 노드를 연결시켜 원형으로 만든 구조이다.</li>
    </div>
</template>
<script>
export default {
    
}
</script>
<style>
.dataStr-content{
    padding:100px;
}
</style>
